<a href="https://colab.research.google.com/github/learn-programmers/programmers_kdt_II/blob/main/9%EC%A3%BC%EC%B0%A8_SQL_%EC%8B%A4%EC%8A%B5_3%EC%9D%BC%EC%B0%A8_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

주피터 SQL 엔진 설정

In [1]:
%load_ext sql

In [2]:
# 데이터베이스 redshift 연결
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://guest:Guest1!*@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod

/usr/local/lib/python3.6/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

'Connected: guest@prod'

다양한 SELECT 실행해보기

In [5]:
# raw_data의 session_timestamp테이블에서 모든 필드(칼럼)을 읽어오되 처음 10개만 보여라.
%%sql 

SELECT * FROM raw_data.session_timestamp LIMIT 10

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[('c41dd99a69df04044aa4e33ece9c9249', datetime.datetime(2019, 5, 1, 0, 35, 59, 897000)),
 ('fdc0eb412a84fa549afe68373d9087e9', datetime.datetime(2019, 5, 1, 2, 53, 48, 503000)),
 ('0a54b19a13b6712dc04d1b49215423d8', datetime.datetime(2019, 5, 1, 12, 18, 26, 637000)),
 ('a914ecef9c12ffdb9bede64bb703d877', datetime.datetime(2019, 5, 1, 13, 41, 29, 267000)),
 ('05ae14d7ae387b93370d142d82220f1b', datetime.datetime(2019, 5, 1, 14, 17, 54, 83000)),
 ('eddeb82df22554fa67c641e3f8a25566', datetime.datetime(2019, 5, 1, 14, 42, 50, 487000)),
 ('4c4ea5258ef3fb3fb1fc48fee9b4408c', datetime.datetime(2019, 5, 1, 15, 8, 15, 557000)),
 ('8ae1da0fe37c98412768453f82490da2', datetime.datetime(2019, 5, 1, 15, 20, 27, 377000)),
 ('60131a2a3f223dc8f4753bcc5771660c', datetime.datetime(2019, 5, 1, 15, 53, 7, 17000)),
 ('90f4760fcc9b69c13da7368c5c2917f3', datetime.datetime(2019, 5, 1, 16, 15, 43, 423000))]

In [ ]:
# DATE는 ts(time stamp)를 인자로 받아서 날짜와 시간 중 날짜만 리턴한다. 
# 그리고 그 필드(칼럼)의 이름을 ts에서 date로 바꾼다.
# 처음부터 10개까지만 보인다.
%%sql

SELECT DATE(ts) date, sessionID FROM raw_data.session_timestamp LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 5, 1), '7cdace91c487558e27ce54df7cdb299c'),
 (datetime.date(2019, 5, 1), '94f192dee566b018e0acf31e1f99a2d9'),
 (datetime.date(2019, 5, 1), '7ed2d3454c5eea71148b11d0c25104ff'),
 (datetime.date(2019, 5, 1), 'f1daf122cde863010844459363cd31db'),
 (datetime.date(2019, 5, 1), 'fd0efcca272f704a760c3b61dcc70fd0'),
 (datetime.date(2019, 5, 1), '8804f94e16ba5b680e239a554a08f7d2'),
 (datetime.date(2019, 5, 1), 'c5f441cd5f43eb2f2c024e1f8b5d00cd'),
 (datetime.date(2019, 5, 1), 'd5fcc35c94879a4afad61cacca56192c'),
 (datetime.date(2019, 5, 1), '3d191ef6e236bd1b9bdb9ff4743c47fe'),
 (datetime.date(2019, 5, 1), 'c17028c9b6e0c5deaad29665d582284a')]

In [7]:
# 위와 동일한데 ts의 내림차순(최근시간부터)보인다.
# SELECT 문에서 리턴하는 레코드들을 ts필드로 소팅하되 내림차순으로 한다.
%%sql

SELECT DATE(ts) date, sessionID FROM raw_data.session_timestamp ORDER BY ts 
desc LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 11, 30), '6309ff4befccf8ba77b16141fab763c6'),
 (datetime.date(2019, 11, 30), '42daed3b750cc5c6270636fddee0486d'),
 (datetime.date(2019, 11, 30), '398c674511e98d3e9bd40ba5bfa67af8'),
 (datetime.date(2019, 11, 30), '1e65c9f788d6382abc0ee60886e7fa4a'),
 (datetime.date(2019, 11, 30), 'ec6d363a01a8a0691d24b8556bc1fb61'),
 (datetime.date(2019, 11, 30), '8f48bd8292fc4540404dc9dae06175e6'),
 (datetime.date(2019, 11, 30), '89a76004709bb668a8aefb6306a6aed1'),
 (datetime.date(2019, 11, 30), '9cfaefd1e81f637fad6330ff16eb1f39'),
 (datetime.date(2019, 11, 30), 'bbf2f1c020c5e39734c73223784bd7b4'),
 (datetime.date(2019, 11, 30), 'bac82af401b714e895c9c46af11f76ea')]

In [ ]:
# session_timestamp 테이블을 보고 날짜별로 일별 세션의 수를 카운트한다.
# GROUP BY 1은 SELCECT의 첫번째 필드이다. 1이 아니라 date, DATE(ts)라고 써도 된다.
# GROUP BY 1이라고 하면 SELECT의 첫번째 필드를 보고 그것과 같은 값을 갖는 모든 레코드들을 하나로 그룹핑해서, 그 안에서 몇개의 세션 아이디가 있는지 카운트하고 처음 10개만 보여준다.
S%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 10), 176),
 (datetime.date(2019, 5, 12), 171),
 (datetime.date(2019, 5, 13), 178)]

In [8]:
# 위를 세션의 수가 가장 많은 처음 10개의 날짜로 소팅해서 보여준다.
# ORDER BY 2로 세션의 수인 두번째 필드를 지정, DESC이면 디센딩 오더(내림차순)으로 정렬
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 10, 23), 678),
 (datetime.date(2019, 11, 13), 671),
 (datetime.date(2019, 11, 12), 668),
 (datetime.date(2019, 10, 11), 665),
 (datetime.date(2019, 10, 29), 660),
 (datetime.date(2019, 10, 21), 653),
 (datetime.date(2019, 11, 5), 652),
 (datetime.date(2019, 11, 11), 651),
 (datetime.date(2019, 10, 14), 648),
 (datetime.date(2019, 11, 7), 645)]

In [9]:
# 날짜순으로 가장 빠른 날짜부터 10개의 날짜에 대해서 세션 수를 카운트 
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1
LIMIT 10; -- DESC

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

JOIN에 대해 배워보자. 일별 방문 유니크한 사용자의 수를 계산하고 싶다면?

In [ ]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
# user_session_channel은 usc라 하고 session_timestamp는 st라 한다.
# 두개의 테이블을 연결할 때 ON다음이 연결조건이다. 첫번째 테이블의 세션아이디와 두번째 테이블의 세션아이디가 같은 경우에만 연결한다.
# INNER JOIN이다. 양쪽에 JOIN조건이 모두 만족하는 것들만 조인한다.
# 두 테이블이 JOIN되어 하나의 테이블이 만들어진 상태에서, st 테이블의 ts를 보고 날짜만 뽑고, GROUP BY 1으로 같은 날짜에 속한 모든 레코드들을 모아서 유저 아이디만 카운트한다.
# 그리고 ORDER BY 1로 내림차순으로 10개의 데이터만 본다.
%%sql

SELECT DATE(st.ts) date, COUNT(usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

In [10]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
# 위와 동일한것인데 DISTINCT의 유무 차이!
# COUNT는 안에 뭐가 들어오건 값이 비어있지만 않으면 무조건 하나씩 센다.
# DISTINCT를 붙이면 뒤의 값이 비어있지 않아도 동일한 값이면 하나만 카운트 한다.
# 위의 count에 147은 세션의 수이다.
# 아래의 count에 119는 유니크한 사용자의 수이다.
%%sql

SELECT DATE(st.ts) date, COUNT(DISTINCT usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
10 rows affected.

[(datetime.date(2019, 5, 1), 119),
 (datetime.date(2019, 5, 2), 127),
 (datetime.date(2019, 5, 3), 130),
 (datetime.date(2019, 5, 4), 122),
 (datetime.date(2019, 5, 5), 124),
 (datetime.date(2019, 5, 6), 133),
 (datetime.date(2019, 5, 7), 147),
 (datetime.date(2019, 5, 8), 135),
 (datetime.date(2019, 5, 9), 145),
 (datetime.date(2019, 5, 10), 144)]

In [11]:
# 채널별 유니크한 사용자수
# DATE(st.ts) date가 channel로 바뀜.
%%sql

SELECT channel, count(st.sessionID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
6 rows affected.

[('Facebook', 16791),
 ('Google', 16982),
 ('Instagram', 16831),
 ('Naver', 16921),
 ('Organic', 16904),
 ('Youtube', 17091)]

In [12]:
# raw_data.user_session_channel 테이블에 field라는 컬럼중에 채널 이름에 o혹은 O가 있는 레코드들만 리턴하되 레코드의 채널 필드들만 리턴. 
# 단, 중복하지 않고 리턴.(DISTINCT)
# ilike를 쓰면 대소문자 구분하지 않는다.
%%sql

SELECT DISTINCT channel FROM raw_data.user_session_channel 
WHERE channel ilike '%o%'

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
4 rows affected.

[('Organic',), ('Google',), ('Youtube',), ('Facebook',)]

In [13]:
# raw_data.user_session_channel 테이블에 field라는 컬럼중에 채널 이름에 o 있는 레코드들만 리턴하되 레코드의 채널 필드들만 리턴. 
# 단, 중복하지 않고 리턴.(DISTINCT)
# ilike가 아닌 like를 쓰면 대소문자를 구분한다.
%%sql

SELECT DISTINCT channel FROM raw_data.user_session_channel 
WHERE channel like '%o%'

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
3 rows affected.

[('Google',), ('Youtube',), ('Facebook',)]

In [14]:
# user_session_channel 테이블에 있는 레코드들 중에 채널 이름에 o, O가 있는 모든 레코드의 수 카운트
%%sql

SELECT COUNT(1) FROM raw_data.user_session_channel 
WHERE channel ilike '%o%'

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
1 rows affected.

[(67768,)]

판다스와 연동하는 방법

In [15]:
result = %sql SELECT * FROM raw_data.user_session_channel
df = result.DataFrame() # SQL 결과를 받아서 데이터프레임으로 저장

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
101520 rows affected.

In [16]:
df.head()

   userid                         sessionid    channel
0     779  7cdace91c487558e27ce54df7cdb299c  Instagram
1     230  94f192dee566b018e0acf31e1f99a2d9      Naver
2     369  7ed2d3454c5eea71148b11d0c25104ff    Youtube
3     248  f1daf122cde863010844459363cd31db      Naver
4     676  fd0efcca272f704a760c3b61dcc70fd0  Instagram

In [ ]:
# %%sql
# SELECT channel, count(st.sessionID)
# FROM raw_data.session_timestamp st
# JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
# GROUP BY 1
# ORDER BY 1
# 위의 SQL문과 동일한 결과
df.groupby(["channel"]).size()

channel
Facebook     16791
Google       16982
Instagram    16831
Naver        16921
Organic      16904
Youtube      17091
dtype: int64

In [17]:
# 위와 동일한 결과
df.groupby(["channel"])["sessionid"].count()

channel
Facebook     16791
Google       16982
Instagram    16831
Naver        16921
Organic      16904
Youtube      17091
Name: sessionid, dtype: int64

In [18]:
# sql문을 판다스 데이터프레임으로 받아오기
result = %sql SELECT * FROM raw_data.session_timestamp
df_st = result.DataFrame()

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/prod
101520 rows affected.

In [20]:
# 파이썬의 람다함수를 이용해 session_timestamp의 ts에서 시간,분,초는 빼고 연,월,일만 남긴다.
# 데이터프레임에 date이라는 새로운 필드(칼럼)를 만든다.
df_st['date'] = df_st['ts'].apply(lambda x: "%d-%02d-%02d" % (x.year, x.month, x.day))

In [21]:
df_st.head() # date라는 새로운 칼럼이 생김

                          sessionid                      ts        date
0  c41dd99a69df04044aa4e33ece9c9249 2019-05-01 00:35:59.897  2019-05-01
1  fdc0eb412a84fa549afe68373d9087e9 2019-05-01 02:53:48.503  2019-05-01
2  0a54b19a13b6712dc04d1b49215423d8 2019-05-01 12:18:26.637  2019-05-01
3  a914ecef9c12ffdb9bede64bb703d877 2019-05-01 13:41:29.267  2019-05-01
4  05ae14d7ae387b93370d142d82220f1b 2019-05-01 14:17:54.083  2019-05-01

In [22]:
# date으로 그룹바이를 한 뒤 같은 그룹에 들어온 것들을 카운트
# %%sql
# SELECT DATE(ts) date, COUNT(sessionID)
# FROM raw_data.session_timestamp
# GROUP BY 1
# ORDER BY 1
# LIMIT 10; -- DESC
# 위의 sql문과 동일
df_st.groupby(["date"]).size()  # .sort_values(["date"])

date
2019-05-01    147
2019-05-02    161
2019-05-03    150
2019-05-04    142
2019-05-05    144
             ...
2019-11-26    633
2019-11-27    617
2019-11-28    516
2019-11-29    531
2019-11-30    562
Length: 214, dtype: int64

In [ ]:
# 날짜별로 세션의 수를 카운트하고 날짜 기준으로 내림차순으로 소팅
df_st.groupby(["date"])["sessionid"].count().reset_index(name='count').sort_values("date", ascending=False)

           date  count
213  2019-11-30    562
212  2019-11-29    531
211  2019-11-28    516
210  2019-11-27    617
209  2019-11-26    633
..          ...    ...
4    2019-05-05    144
3    2019-05-04    142
2    2019-05-03    150
1    2019-05-02    161
0    2019-05-01    147

[214 rows x 2 columns]